{
  "intro": {
    "welcome": "مرحبًا بك",
    "name": "أنا علي فهمي",
    "summary": "مطور ويب شغوف متخصص في إنشاء تطبيقات ديناميكية تركز على المستخدم. أمتلك خبرة في تطوير الواجهة الأمامية والخلفية، وأسعى إلى تقديم حلول مبتكرة وفعّالة وقابلة للتوسع. يدفعني شغفي بحل المشكلات والتعلم المستمر إلى تقديم أعمال عالية الجودة تعزّز تجربة المستخدم وتدفع حدود تطوير الويب الحديث."
  },
  "buttons": {
    "downloadCV": "تحميل السيرة الذاتية",
    "contact": "تواصل معي",
    "showWork": "عرض العمل"
  },
  "headers": {
    "aboutMe": "من أنا",
    "myServices": "خدماتي",
    "myTech": "التكنولوجيا",
    "journey": "رحلتي",
    "latest": "آخر الأعمال"
  },
  "latest": {
    "title": "مطور الواجهة الأمامية",
    "description": "انتقلت إلى دور مطور الواجهة الأمامية، ووسّعت مهاراتي من تصميم الجرافيك إلى بناء واجهات مستخدم تفاعلية واستجابية. بدأت بالتقنيات الأساسية مثل HTML, CSS, وJavaScript، ثم سرعان ما أتقنت أطر العمل مثل React.js، التي أصبحت أداتي المفضلة لبناء تطبيقات ويب ديناميكية وفعّالة."
  },
  "aboutMe": "أنا طالب متخصص في علوم الحاسب والهندسة في جامعة BMSIT، أمتلك شغفًا كبيرًا بتطوير التطبيقات وتصميم الجرافيك. إلى جانب دراستي الأكاديمية، اكتسبت خبرة عملية من خلال العمل على مشاريع تستخدم تقنيات حديثة مثل React، Node.js، Express.js، MongoDB وTailwind CSS. وبصفتي محبًا لحل المشكلات، أعمل باستمرار على تطوير مهاراتي للتميز في المجال التقني والمساهمة بأفكار مبتكرة في مشاريعي.",
  "services": {
    "uxUiDesign": {
      "title": "تصميم تجربة وواجهة المستخدم",
      "description": "أركّز على إنشاء تصاميم بديهية وجذّابة بصريًا تعزّز تجربة المستخدم. أنا شغوف بفهم احتياجات وسلوكيات المستخدمين لإنشاء واجهات سلسة تركز على المستخدم. تشمل مهاراتي إنشاء النماذج الأولية، التصميم التخطيطي، وإجراء أبحاث المستخدم لضمان أن المنتج النهائي لا يبدو رائعًا فحسب، بل يؤدّي غرضه بفعالية."
    },
    "webDevelopment": {
      "title": "تطوير المواقع",
      "description": "أتخصص في بناء مواقع ديناميكية واستجابية تقدم تجارب مستخدم سلسة عبر مختلف الأجهزة والمنصات. بفضل إتقاني للتقنيات الأمامية مثل React، HTML، CSS، وJavaScript، أُنشئ واجهات تفاعلية وجذابة تلبي الأهداف الوظيفية والجمالية. أما في الجانب الخلفي، فأعمل باستخدام Node.js، Express وMongoDB لبناء تطبيقات فعّالة وقابلة للتوسع."
    },
    "mobileDevelopment": {
      "title": "تطوير تطبيقات الهواتف المحمولة",
      "description": "أقوم بإنشاء تطبيقات هواتف محمولة متعددة المنصات باستخدام React Native. ومع فهم قوي لمبادئ تطوير التطبيقات، أُنشئ تطبيقات استجابية، بديهية، وعالية الأداء تعمل بسلاسة عبر منصات iOS وAndroid. تشمل مهاراتي دمج الوحدات الأصلية، تحسين أداء التطبيقات، وضمان تنقل سلس مع مكوّنات ذات واجهة مستخدم متناسقة."
    }
  },
  "journey": {
    "graphicDesign": {
      "title": "تصميم الجرافيك",
      "description": "بدأت رحلتي كمصمّم جرافيك، وانغمست في عالم الإبداع وسرد القصص البصرية. مسلّحًا بشغف بالتّصميم، بدأت استكشاف أدوات مثل Adobe Photoshop وIllustrator وCanva، وصقلت مهاراتي في إنشاء محتوى بصري جذّاب. عملت على مشاريع متنوعة من تصميم الشعارات والعلامات التجارية إلى الرسومات الخاصة بوسائل التواصل الاجتماعي، وطوّرت تدريجيًا عينًا للجماليات والتفاصيل."
    },
    "frontEnd": {
      "title": "مطور الواجهة الأمامية",
      "description": "انتقلت إلى دور مطور الواجهة الأمامية، ووسّعت مهاراتي من تصميم الجرافيك إلى بناء واجهات مستخدم تفاعلية واستجابية. بدأت بالتقنيات الأساسية مثل HTML, CSS, وJavaScript، ثم سرعان ما أتقنت أطر العمل مثل React.js، التي أصبحت أداتي الأساسية لبناء تطبيقات ويب ديناميكية وفعّالة."
    },
    "backEnd": {
      "title": "مطور الخلفية",
      "description": "انغمست في تطوير البرمجيات الخلفية، ووسّعت خبرتي واكتسبت فهمًا أعمق لبناء تطبيقات ويب قوية وقابلة للتوسع. أتقنت Node.js وExpress.js، مما مهد الطريق لإنشاء منطق فعّال من جهة الخادم وواجهات برمجة تطبيقات قوية. عملت بشكل مكثّف مع قواعد البيانات مثل MongoDB، وتعلمت تصميم وإدارة المخططات، وتنفيذ عمليات CRUD، وتحسين معالجة البيانات لتطبيقات العالم الحقيقي."
    },
    "fullStack": {
      "title": "مطور برمجيات متكامل",
      "description": "تطوّرت لأصبح مطور برمجيات متكامل، وأدمج بسلاسة بين خبراتي في الواجهة الأمامية والخلفية لبناء تطبيقات ويب شاملة من البداية للنهاية. بالاعتماد على تقنية MERN، طوّرت حلولًا قوية وديناميكية وقابلة للتوسع، مع التعامل بكفاءة مع كلا جانبي النظام: العميل والخادم. غالبًا ما تضمنت مشاريعي تنفيذ ميزات معقّدة مثل أنظمة المصادقة."
    }
  },
  "footer": {
    "message": "جارٍ التعلّم",
    "copyright": "جميع الحقوق محفوظة"
  }
}
